**Step-1: Import required packages**

In [12]:
import pandas as pd # data frame operations
import numpy as np # math operations
import matplotlib.pyplot as plt #plotting
import seaborn as sns    #plotting

**Step-2: Create a Dataframe uusing A list**

In [17]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0  Ramesh  20
1  Suresh  22
2  Mahesh  24

**pd.DataFrame(data,index,columns)**

- data=None,

- index: Index or array-like

- columns: Index or array-like

In [26]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,age)

         0
20  Ramesh
22  Suresh
24  Mahesh

**step-3: Add the column names**

In [32]:
names=["Ramesh","Suresh","Mahesh"]
age=[20,22,24]
cols =["Names","Age"]
# pd.DataFrame(data,index,columns)
pd.DataFrame(zip(names,age), columns=cols)

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

In [40]:
names=["Ramesh","Suresh","Mahesh"]
index=[0,1,2]
cols =["Names"]
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,index, columns=cols) # so if we take only names. python will get confuse and throw a error, bcoz t thinks only one column, so that's why use zip instaed for more than 1 clumn and use argument names

    Names
0  Ramesh
1  Suresh
2  Mahesh

**Step -4 : CAdd the row names**

In [42]:
names=["Ramesh","Suresh","Mahesh"]
index=[0,1,2]
cols =["Names","Age"]
ids = ['A','B','C']

pd.DataFrame(zip(names,age),index=ids,columns=cols)

    Names  Age
A  Ramesh   20
B  Suresh   22
C  Mahesh   24

**Step 5: Create empty Dataframe and update the df**

In [47]:
# Above one we created dataframe with values directly
# now first we will create emptyy df
# then we will add the values

df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [49]:
df['Names']
#If I run this if any column values available under names
# otherwise error
# Either you are creating a new column
# or you are modify the column values

KeyError: 'Names'

In [55]:
df=pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','Mahesh']
df['Age'] = [20,22,24]
df
#this means eiher we creating new column or modifyning existing column

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   24

In [59]:
df['Age']=[30,32,34] # updating 
df['age']=[100,200,300] # craeting - case sensitive age not equal to Age
df['City'] =['Hyd','Blr','Chennai'] # Creating
df
# python case sensitive
#'Age' and 'age' different

    Names  Age  age     City
0  Ramesh   30  100      Hyd
1  Suresh   32  200      Blr
2  Mahesh   34  300  Chennai

**Notes**

- Python case sensitive

- 'Age' and 'age' consider as different

- Updated column values always should be len dataframe

- Dont expect Null like sql if we miss any value

**step-6: Drop the column**

- labels: 'IndexLabel | None' = None,
- axis: 'Axis' = 0,
- index: 'IndexLabel | None' = None,
- columns: 'IndexLabel | None' = None,
- level: 'Level | None' = None,
- inplace: 'bool' = False,

In [83]:
# what is our dataframe name : df
# I want to drop 'age' column
# what is the 
df.drop(2,axis=0) # explicitly drop row
df.drop(2) # no error 2nd means 3rd row
df.drop(2,axis=1) #Exp drop  column

KeyError: '[2] not found in axis'

In [85]:
df.drop(2)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [87]:
df.drop([2])

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [89]:
df.drop(2,axis=0)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [105]:
df.drop([1,2])

    Names  Age  age City
0  Ramesh   30  100  Hyd

In [97]:
df.drop(2,axis=1)

KeyError: '[2] not found in axis'

In [99]:
df.drop(20)

KeyError: '[20] not found in axis'

In [107]:
df

    Names  Age  age     City
0  Ramesh   30  100      Hyd
1  Suresh   32  200      Blr
2  Mahesh   34  300  Chennai

In [109]:
df.drop(columns='age')

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [111]:
df.drop(columns=['age'])

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [113]:
df.drop(index=2)

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [163]:
df.drop(index=[2])

    Names  Age City
0  Ramesh   30  Hyd
1  Suresh   32  Blr

In [117]:
df.columns

Index(['Names', 'Age', 'age', 'City'], dtype='object')

In [119]:
df.columns[2]

'age'

In [139]:
df.drop('age',axis=1)

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [135]:
df.drop(labels=[2])

    Names  Age  age City
0  Ramesh   30  100  Hyd
1  Suresh   32  200  Blr

In [137]:
df.drop(columns=['age'])

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [161]:
df

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [157]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [159]:
df

    Names  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mahesh   34  Chennai

In [165]:
df.drop(columns=['City'],inplace=True)

In [167]:
df

    Names  Age
0  Ramesh   30
1  Suresh   32
2  Mahesh   34

In [ ]:
# assignment -1
df.rename
df.shape
df.size
df.columns
df.isnull()
len(df)
df.info
df.drop_duplicates
df.dtypes

In [1]:
import pandas as pd

In [3]:
df =pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','Sathish']
df['Age'] = [20,22,24]
df['City'] = ['Hyd','Blr','Pune']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [5]:
df.drop(2)

    Names  Age City
0  Ramesh   20  Hyd
1  Suresh   22  Blr

In [7]:
df.drop(2,axis=0)

    Names  Age City
0  Ramesh   20  Hyd
1  Suresh   22  Blr

In [9]:
df.drop(index=2)

    Names  Age City
0  Ramesh   20  Hyd
1  Suresh   22  Blr

In [11]:
df.drop([1,2])

    Names  Age City
0  Ramesh   20  Hyd

In [13]:
df.drop([1,2],axis=0)

    Names  Age City
0  Ramesh   20  Hyd

In [21]:
df.drop(index=[1,2])

    Names  Age City
0  Ramesh   20  Hyd

In [23]:
df.drop('City')

KeyError: "['City'] not found in axis"

In [31]:
df.drop('City',axis=1)

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [33]:
df.drop(columns='City')

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [37]:
df.drop(['Names','City'],axis=1)

   Age
0   20
1   22
2   24

**mapper means dictionary**

In [40]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [42]:
dict1={'City':'city'}
df.rename(dict1,axis=1)

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [46]:
df.rename(dict1) # , axis or columns must mention, python willl confuse

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [50]:
df.rename(columns=dict1)

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [58]:
dict2={1:4}
df.rename(index=dict2)

     Names  Age  City
0   Ramesh   20   Hyd
4   Suresh   22   Blr
2  Sathish   24  Pune

In [62]:
df.columns=['A','B','C']
# inplace also not required
df

         A   B     C
0   Ramesh  20   Hyd
1   Suresh  22   Blr
2  Sathish  24  Pune

In [64]:
df

         A   B     C
0   Ramesh  20   Hyd
1   Suresh  22   Blr
2  Sathish  24  Pune

In [66]:
df.index=['I','II','III']
df

           A   B     C
I     Ramesh  20   Hyd
II    Suresh  22   Blr
III  Sathish  24  Pune

In [72]:
df =pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','Sathish']
df['Age'] = [20,22,24]
df['City'] = ['Hyd','Blr','Pune']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [ ]:
**Step-8: append the rowss**
    
- we need to use **loc** (interview qsn)

- df.loc[<row numbers>,<colmn names>]

- example: df.loc[2,'City']

- Multiple rows from mu;tiple columns

- example : df.loc[[1,2],['Names','City']]

- df.loc[start:stop:step,<column names>]

In [80]:
df.loc[2,'City']

'Pune'

In [78]:
df.loc[[1,2],['Names','City']]

     Names  City
1   Suresh   Blr
2  Sathish  Pune

In [82]:
df.loc[2] # 2nd index of all columns

Names    Sathish
Age           24
City        Pune
Name: 2, dtype: object

In [90]:
df.loc[[2]] # 2nd index of all columns

     Names  Age  City
2  Sathish   24  Pune

In [84]:
df.loc[[1,2]] # 2

     Names  Age  City
1   Suresh   22   Blr
2  Sathish   24  Pune

In [86]:
df.loc[0:3]

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [88]:
df.loc[:]

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune

In [94]:
type(df.loc[2])

pandas.core.series.Series

In [96]:
type(df.loc[[2]])

pandas.core.frame.DataFrame

In [104]:
t1=df.loc[2]  # series
print(t1,type(t1))

Names    Sathish
Age           24
City        Pune
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [106]:

t2=df.loc[[2]]  # df
print(t2,type(t2))

     Names  Age  City
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [108]:

t3=df.loc[[1,2]] # df
print(t3,type(t3))

     Names  Age  City
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [110]:

t4=df.loc[0:3]  #s
print(t4,type(t4))

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [112]:

t5=df.loc[:] #s
print(t5,type(t5))

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [114]:

t6=df.loc[2,'City'] #s
print(t6,type(t6))

Pune <class 'str'>

In [116]:

t7=df.loc[2,['City']] #df
print(t7,type(t7))

City    Pune
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [118]:

t8=df.loc[[2],['City']] #  df
print(t8,type(t8))

   City
2  Pune <class 'pandas.core.frame.DataFrame'>

In [120]:

t9=df.loc[[1,2,],['Names','City']]
print(t9,type(t9))

     Names  City
1   Suresh   Blr
2  Sathish  Pune <class 'pandas.core.frame.DataFrame'>

In [122]:

t10=df.loc[:,'City']
print(t10,type(t10))

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object <class 'pandas.core.series.Series'>

In [124]:

t11=df.loc[:,['City']]
print(t11,type(t11))

   City
0   Hyd
1   Blr
2  Pune <class 'pandas.core.frame.DataFrame'>

**iloc**

In [ ]:
df.loc[<rows>,<columns names>]
df.iloc[<rows>,<columns number>]

In [135]:
t=df.iloc[2]  # series
print(t,type(t))

Names    Sathish
Age           24
City        Pune
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [133]:
t=df.iloc[[2]]  
print(t,type(t))

     Names  Age  City
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [139]:
t=df.iloc[[1,2]] 
print(t,type(t))

     Names  Age  City
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [141]:
t=df.iloc[0:3]  
print(t,type(t))

     Names  Age  City
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [143]:
t=df.iloc[0:3]  
print(t,type(t))

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [145]:
t=df.iloc[:]  
print(t,type(t))

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune <class 'pandas.core.frame.DataFrame'>

In [147]:
t=df.iloc[2,2]  
print(t,type(t))

Pune <class 'str'>

In [149]:
t=df.iloc[2,[2]]  
print(t,type(t))

City    Pune
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [153]:
t=df.iloc[[2],[2]]  
print(t,type(t))

   City
2  Pune <class 'pandas.core.frame.DataFrame'>

In [155]:
t=df.iloc[[1,2],[0,2]]  
print(t,type(t))

     Names  City
1   Suresh   Blr
2  Sathish  Pune <class 'pandas.core.frame.DataFrame'>

In [157]:
t=df.iloc[:,2]  
print(t,type(t))

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object <class 'pandas.core.series.Series'>

In [159]:
t=df.iloc[:,[2]]  
print(t,type(t))

   City
0   Hyd
1   Blr
2  Pune <class 'pandas.core.frame.DataFrame'>

In [ ]:

append and replace - assignment

**step 9 - save the dataframe**

- where I want to save 

- on what name I want to save

- on what extension: .csv, .xlsx

In [163]:
path1 =r"C:\Users\bhara\Documents\data_frame_files\employees.csv"
path2=r"employees.csv"
path3 =r"C:\Users\bhara\Documents\data_frame_files\employees.xlsx"
path4= r"employees.xlsx"

df.to_csv(path1)
df.to_csv(path2)
df.to_excel(path3)
df.to_excel(path4)

In [165]:
pd.read_csv(path1) # an unnamed column is coming

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   22   Blr
2           2  Sathish   24  Pune

In [171]:
df.to_csv(path1, index=False)
df.to_csv(path2,index=False)
df.to_excel(path3,index=False)
df.to_excel(path4,index=False)

In [175]:
pd.read_csv(path1) # unnamed column is gone

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   22   Blr
2  Sathish   24  Pune